package consts

const PhoneRegRuler = "^1[3456789]{1}\\d{9}$"

// IdCardRegRuler IdCardRegRuler 18位身份证 ^(\d{17})([0-9]|X)$
// 匹配规则:
// 身份证号码为15位或者18位，15位时全为数字，
// 18位前17位为数字，最后一位是校验位，可能为数字或字符X
const IdCardRegRuler = "(^[1-9]\\d{5}(18|19|([23]\\d))\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$)|" +
	"(^[1-9]\\d{5}\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{2}$)"

// (^\\d{15}$)|(^\\d{18}$)|(^\\d{17}(\\d|X|x)$)

// JsonKeyRegRuler 匹配 json key
const JsonKeyRegRuler = `\"(\w+)\":`
